app/views/events/show.html.erb

<ul>
<% @event.participants.each do |single_participant| %>
---
SELECT "participants".* FROM "participants" WHERE "participants"."event_id" = ?  [["event_id", 1]]