app/controllers/events_controller.rb

	def create
		@event = Event.new(event_params)
		if @event.save
---
INSERT INTO "events" ("created_at", "description", "location", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 25 Jan 2014 16:41:40 UTC +00:00], ["description", ""], ["location", ""], ["name", "Hosanna Fuller"], ["updated_at", Sat, 25 Jan 2014 16:41:40 UTC +00:00]]

	def show
    	@event = Event.find(event_id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@event = Event.find(event_id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
  	@event = Event.find(event_id)
  	@event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]