app/controllers/participants_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "participants" ("created_at", "event_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 25 Jan 2014 20:38:22 UTC +00:00], ["event_id", 1], ["name", "God"], ["updated_at", Sat, 25 Jan 2014 20:38:22 UTC +00:00]]
---
	 def create
    @event = Event.find(params[:event_id])
    @participant = @event.participants.new(params_participant)
    if @participant.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "participants" SET "guests" = ?, "updated_at" = ? WHERE "participants"."id" = 1  [["guests", 1], ["updated_at", Sat, 25 Jan 2014 20:42:00 UTC +00:00]]
---
   def add_guest
    @event = Event.find(params[:event_id])
    @participant = Participant.find(params[:id])
    @participant.guests += 1
    @participant.save